In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import DataFrame, Series

In [4]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index=['a', 'b', 'c', 'd'],
              columns=['one', 'two'])

In [5]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [7]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [8]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [20]:
data = DataFrame(np.random.randint(1, 10, size=(10, 5)), columns=['a', 'b', 'c', 'd', 'e'])

In [21]:
data

   a  b  c  d  e
0  6  9  5  2  2
1  2  8  9  3  6
2  4  1  6  4  1
3  4  6  7  7  3
4  3  5  7  9  4
5  6  2  6  6  3
6  3  2  1  9  1
7  6  2  2  2  3
8  4  7  2  2  2
9  6  6  9  6  9

In [24]:
uniques = data['a'].unique()

In [25]:
uniques

array([6, 2, 4, 3])

In [26]:
pd.value_counts(data['b'])

2    3
6    2
9    1
8    1
7    1
5    1
1    1
Name: b, dtype: int64